In [ ]:
import pandas as pd
import numpy as np

1) Задание: загрузить данные из файлов (приложены к письму):
* excel-comp-data.xlsx
* sp500hst.txt

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
data1 = pd.read_excel('/content/drive/MyDrive/контент по финашке/7ой семестр/ТОБД/excel-comp-data.xlsx')
data1.head(1)

   account                        name              street  ...    Jan    Feb    Mar
0   211829  Kerluke, Koepp and Hilpert  34456 Sean Highway  ...  10000  62000  35000

[1 rows x 9 columns]

2) Загрузить данные из файла sp500hst.txt, обозначить столбцы (в соответствии с содержимым).

In [ ]:
names = ['date', 'ticker', 'open', 'high', 'low', 'close', 'volume']
data2 = pd.read_csv('/content/drive/MyDrive/контент по финашке/7ой семестр/ТОБД/sp500hst.txt', header = None, names = names)
data2.head(1)

       date ticker  open   high    low  close  volume
0  20090821      A  25.6  25.61  25.22  25.55   34758

3.1) Создать столбец со значеними средними, между значением дневного минимума и максимума.

In [ ]:
data2 = data2.assign(mean_value = (data2.high + data2.low)/2)
data2.head(1)

       date ticker  open   high    low  close  volume  mean_value
0  20090821      A  25.6  25.61  25.22  25.55   34758      25.415

3.2) Рассчитать среднее значение показателей для каждого из столбцов 3-6.

In [ ]:
for i in names[2:6]:
  print(f'Среднее значение по столбцу {i}: : {data2[i].mean()}')

Среднее значение по столбцу open: : 42.5954576590471
Среднее значение по столбцу high: : 43.10224338767034
Среднее значение по столбцу low: : 42.054463665213184
Среднее значение по столбцу close: : 42.60186484817329

4.1) Создать DataFrame состоящий из строк относящихся только к 13 августа 2010 года.

In [ ]:
dt1 = data2[data2['date'] == 20100813]
dt1.head(1)

         date ticker   open   high   low  close  volume  mean_value
240  20100813      A  27.39  27.85  27.3  27.35   24469      27.575

4.1.2) Из DataFrame, созданного в 4.1, cоздать серию из 30 первых имен

In [ ]:
dt1['ticker'][:30]

240        A
485       AA
726     AAPL
971      ABC
1216     ABT
1273     ACE
1626    ADBE
1871     ADI
2116     ADM
2359     ADP
2601    ADSK
2846     AEE
3091     AEP
3336     AES
3581     AET
3826     AFL
4071     AGN
4316     AIG
4561     AIV
4806     AIZ
5049    AKAM
5294     AKS
5539     ALL
5782    ALTR
6025    AMAT
6270     AMD
6514    AMGN
6758     AMP
7003     AMT
7246    AMZN
Name: ticker, dtype: object

4.2) Из DataFrame, созданного в 4.1, создать новый DataFrame индексом в котором являются имена тикеров.

In [ ]:
dt2 = dt1
dt2.index = dt1['ticker']
dt2.head(3)

            date ticker    open    high      low   close  volume  mean_value
ticker
A       20100813      A   27.39   27.85   27.300   27.35   24469     27.5750
AA      20100813     AA   10.70   10.79   10.575   10.64  154397     10.6825
AAPL    20100813   AAPL  251.03  251.88  249.090  249.10  126738    250.4850

4.3) Создать DataFrame состоящий из строк относящихся только тикеру ALTR.

In [ ]:
dt5 = data2[data2['ticker'] == 'ALTR']
dt5.head(3)

          date ticker   open   high    low  close  volume  mean_value
5544  20090821   ALTR  19.36  19.50  19.15  19.48   54580      19.325
5545  20090824   ALTR  19.51  19.72  19.04  19.13   42059      19.380
5546  20090825   ALTR  19.13  19.39  18.95  19.05   48539      19.170

4.4) Из DataFrame, созданного в 4.3, создать DataFrame индексом в котором являются даты.

In [ ]:
dt6 = dt5
dt6.index = dt5['date']
dt6 = dt6.drop(['date'],axis=1)
dt6.head(3)

         ticker   open   high    low  close  volume  mean_value
date
20090821   ALTR  19.36  19.50  19.15  19.48   54580      19.325
20090824   ALTR  19.51  19.72  19.04  19.13   42059      19.380
20090825   ALTR  19.13  19.39  18.95  19.05   48539      19.170

4.5) В DataFrame, созданном в 4.3, добавить столбец, содержащий только число месяца, к которому относится дата.

In [ ]:
month = pd.to_datetime(dt6.index,format='%Y%m%d').month
dt6['month'] = month
dt6.head(3)

         ticker   open   high    low  close  volume  mean_value  month
date
20090821   ALTR  19.36  19.50  19.15  19.48   54580      19.325      8
20090824   ALTR  19.51  19.72  19.04  19.13   42059      19.380      8
20090825   ALTR  19.13  19.39  18.95  19.05   48539      19.170      8

4.5.1) Создать DataFrame состоящий из строк относящихся только тикеру WAT и объединить его с DataFrame для ALTR.

In [ ]:
wat = data2[data2['ticker'] == 'WAT']
alter = data2[data2['ticker'] == 'ALTR']
alter.index = alter['ticker']
wat.index = wat['ticker']
res = alter.merge(wat, left_on='date', right_on='date')
res.head(3)

       date ticker_x  open_x  high_x  ...  low_y  close_y  volume_y  mean_value_y
0  20090821     ALTR   19.36   19.50  ...  50.33    51.80      9785        51.237
1  20090824     ALTR   19.51   19.72  ...  51.38    51.48      5866        51.700
2  20090825     ALTR   19.13   19.39  ...  51.50    52.23      9567        52.120

[3 rows x 15 columns]

4.5.2) Создать DataFrame в котором присутствует столбец, отражающий разницу в объемах торгов по WAT и ALTR в одинаковые дни и содержит исходные данны об объеме трогов этими акциями.

In [ ]:
wat_alter = res
wat_alter['Vol_dif'] = res.volume_x - res.volume_y
wat_alter.head(3)

       date ticker_x  open_x  high_x  ...  close_y  volume_y  mean_value_y  Vol_dif
0  20090821     ALTR   19.36   19.50  ...    51.80      9785        51.237    44795
1  20090824     ALTR   19.51   19.72  ...    51.48      5866        51.700    36193
2  20090825     ALTR   19.13   19.39  ...    52.23      9567        52.120    38972

[3 rows x 16 columns]

4.6) В DataFrame добавить столбец, содержащий только число месяца, к которому относится дата.

4.7) Из DataFrame выбрать только строки, относящиеся к 13 числу месяца.

In [ ]:
day = pd.to_datetime(wat_alter.date,format='%Y%m%d').dt.day
wat_alter['day'] = day
wat_alter = wat_alter[wat_alter['day'] == 13]
wat_alter.head(3)

        date ticker_x  open_x  high_x  ...  volume_y  mean_value_y  Vol_dif  day
35  20091013     ALTR   21.40   21.59  ...      7004        57.395   133926   13
52  20091113     ALTR   20.77   21.21  ...     11880        60.365    43189   13
92  20100113     ALTR   21.89   22.20  ...      6032        62.585    53574   13

[3 rows x 17 columns]

4) Выяввиь столбцы содержащие минимальные и максимальные значения (если такие столбцы есть). (Проверить, есть ли среди столбцов, столбец с минимальным значением курса акций.)

In [ ]:
data2.head(2)

       date ticker   open   high    low  close  volume  mean_value
0  20090821      A  25.60  25.61  25.22  25.55   34758      25.415
1  20090824      A  25.64  25.74  25.33  25.50   22247      25.535

In [ ]:
col = ['open', 'high', 'low', 'close', 'volume']
for i in col:
  print(f'max in {i} is {data2[i].max()}')
  print(f'min in {i} is {data2[i].min()}')
  print('\n')

max in open is 627.84
min in open is 1.36


max in high is 629.51
min in high is 1.39


max in low is 624.24
min in low is 1.0


max in close is 626.75
min in close is 1.35


max in volume is 21474836
min in volume is 47

5) По данным из 'sp500hst.txt' при помощи Pandas расчитать максимальные значения в 3-6 столбца для дат после 20100801

6) По данным из 'sp500hst.txt' при помощи Pandas расчитать средний объем торгов (обеъм торгов - в последнем столбце) при значениях 3го столбца больше 50.

In [ ]:
data_ = data2[data2['date'] > 20100801]
col = ['open', 'high', 'low', 'close', 'volume']
for i in col:
  print(f'max in {i} is {data_[i].max()}')
  print(f'min in {i} is {data_[i].min()}')
  print('\n')

max in open is 505.85
min in open is 3.67


max in high is 508.6
min in high is 3.75


max in low is 503.559
min in low is 3.57


max in close is 508.1
min in close is 3.7


max in volume is 5741998
min in volume is 161

In [ ]:
data_1 = data_[data_['open'] > 30]
print('Среднее значение по столбцу volume:', data_1['volume'].mean())

Среднее значение по столбцу volume: 35293.19182389937

7) Добавить столбец с расшифровкой названия тикера используя данные из файла sp_data2.csv . В случае нехватки данных об именах тикеров корректно обработать их.

8) Вывести тикеры, для которых не были найдены рсшифровки.

In [ ]:
names = ['ticker','company','proc']
data3 = pd.read_csv('/content/drive/MyDrive/контент по финашке/7ой семестр/ТОБД/sp_data2.csv', sep = ';',header = None, names = names)
data3.head(5)

  ticker     company  proc
0   AAPL       Apple  3.6%
1   AMZN  Amazon.com  3.2%
2  GOOGL    Alphabet  3.1%
3   GOOG    Alphabet  3.1%
4   MSFT   Microsoft  3.0%

In [ ]:
data3 = data3.drop(['proc'], axis = 1)

In [ ]:
res2 = data2.merge(data3, how ='left', left_on='ticker', right_on='ticker')
res2.head(5)

       date ticker   open  ...  volume  mean_value               company
0  20090821      A  25.60  ...   34758    25.41500  Agilent Technologies
1  20090824      A  25.64  ...   22247    25.53500  Agilent Technologies
2  20090825      A  25.50  ...   30891    25.46250  Agilent Technologies
3  20090826      A  25.32  ...   33334    25.39375  Agilent Technologies
4  20090827      A  25.50  ...   70176    25.40000  Agilent Technologies

[5 rows x 9 columns]

In [ ]:
print('тикеры, для которых не были найдены рсшифровки', res2[res2['company'].isnull()].ticker.unique())

тикеры, для которых не были найдены рсшифровки ['AA' 'ACE' 'ACS' 'AKS' 'ALTR' 'AN' 'ANF' 'AOC' 'APOL' 'ARG' 'ATI' 'AVP'
 'AYE' 'BBBY' 'BCR' 'BDK' 'BHI' 'BIG' 'BJS' 'BMC' 'BMS' 'BNI' 'BRCM' 'BTU'
 'CAM' 'CBE' 'CBG' 'CCE' 'CEG' 'CEPH' 'CFN' 'CHK' 'CIEN' 'CLF' 'CNX' 'COH'
 'CPWR' 'CSC' 'CVG' 'CVH' 'DD' 'DELL' 'DF' 'DNB' 'DNR' 'DO' 'DOW' 'DTV'
 'DV' 'DYN' 'EK' 'EMC' 'EP' 'ERTS' 'ESV' 'ETFCD' 'FDO' 'FHN' 'FII' 'FO'
 'FPL' 'FRX' 'FSLR' 'FTR' 'GAS' 'GCI' 'GENZ' 'GME' 'GNW' 'GR' 'HAR' 'HCBK'
 'HCN' 'HNZ' 'HOT' 'HSP' 'IGT' 'ITT' 'JAVA' 'JBL' 'JCP' 'JDSU' 'JNS' 'KBH'
 'KFT' 'KG' 'LIFE' 'LLTC' 'LM' 'LO' 'LSI' 'LTD' 'LUK' 'LXK' 'MBI' 'MDP'
 'MEE' 'MFE' 'MHP' 'MHS' 'MI' 'MIL' 'MJN' 'MOLX' 'MON' 'MOT' 'MTW' 'MUR'
 'MWV' 'MWW' 'NBR' 'NOVL' 'NSM' 'NU' 'NVLS' 'NYT' 'NYX' 'ODP' 'OI' 'PBG'
 'PBI' 'PCL' 'PCLN' 'PCP' 'PCS' 'PDCO' 'PGN' 'PLL' 'POM' 'PTV' 'Q' 'QEP'
 'QLGC' 'R' 'RAI' 'RDC' 'RRD' 'RSH' 'RX' 'S' 'SAI' 'SE' 'SGP' 'SHLD'
 'SIAL' 'SII' 'SLE' 'SLM' 'SNDK' 'SNI' 'SPLS' 'STJ' 'STR' 'SUN' 'SVU'
 'SWN' 'SWY' 'TDC' 'TE' 'TEG' 'TER' 'THC' 'TIE' 'TLAB' 'TSO' 'TWC' 'URBN'
 'VIA' 'VIA.B' 'WAG' 'WFMI' 'WFR' 'WIN' 'WLP' 'WPI' 'WPO' 'WYE' 'WYN' 'X'
 'XTO' 'YHOO' 'ZMH']

9) Рассчитать суммарный объем торгов (столбец 7) для для одинаковых значений (тикеров) из столбца 2 

9.2) Для каждого тикера подсчитать, сколько раз он встречается.

10) Расчитать среднее значение показателей для каждого из столбцов 3-6 для одинаковых значений (тикеров) из столбца 2 и сохранить в новом DataFrame

11) Добавить в DataFrame новый столбец, содержащий объем торгов (столбец 7), нормированный по среднему значению объема торгов для данного тикера.

In [ ]:
r9 = res2.groupby('ticker')['volume'].sum()
print('суммарный объем торгов (столбец 7) для для одинаковых значений (тикеров) из столбца 2:', r9)

суммарный объем торгов (столбец 7) для для одинаковых значений (тикеров) из столбца 2: ticker
A        8609336
AA      81898998
AAPL    52261170
ABC      9006756
ABT     18975870
          ...
XTO     21297931
YHOO    56837171
YUM     10971538
ZION    15551119
ZMH      4938916
Name: volume, Length: 524, dtype: int64

In [ ]:
print('сколько встречается каждый тикер:')
t = res2.groupby('ticker').agg('count')

сколько встречается каждый тикер:

In [ ]:
t.open

ticker
A       245
AA      245
AAPL    241
ABC     245
ABT     245
       ...
XTO     207
YHOO    243
YUM     245
ZION    244
ZMH     245
Name: open, Length: 524, dtype: int64

In [ ]:
# Расчитать среднее значение показателей для каждого из столбцов 3-6 для одинаковых значений (тикеров) из столбца 2 и сохранить в новом DataFrame
t = res2.groupby('ticker')
print(t.agg({'open': 'mean', 'high': 'mean','low': 'mean','close': 'mean'}))

              open        high         low       close
ticker
A        30.234857   30.567838   29.866467   30.246143
AA       13.086959   13.275341   12.842954   13.047345
AAPL    221.342427  223.556147  218.409411  221.125341
ABC      27.432122   27.683660   27.126983   27.429347
ABT      50.996776   51.365541   50.555472   50.986490
...            ...         ...         ...         ...
XTO      44.640338   45.057131   44.132049   44.588889
YHOO     15.854774   16.050593   15.646220   15.847130
YUM      37.456898   37.816882   37.094593   37.479633
ZION     19.694057   20.171136   19.226905   19.702861
ZMH      56.220980   56.799984   55.648306   56.246122

[524 rows x 4 columns]

In [ ]:
# Добавить в DataFrame новый столбец, содержащий объем торгов (столбец 7), нормированный по среднему значению объема торгов для данного тикера.

# новый столбец:
temp = res2.groupby('ticker').agg({'volume': 'mean'}) #  - объем торгов
temp = temp.rename({'volume':'mean_volume'}, axis=1)
temp

          mean_volume
ticker
A        35140.146939
AA      334281.624490
AAPL    216851.327801
ABC      36762.269388
ABT      77452.530612
...               ...
XTO     102888.555556
YHOO    233897.823045
YUM      44781.787755
ZION     63734.094262
ZMH      20158.840816

[524 rows x 1 columns]

In [ ]:
# соединение таблиц
itog = res2.merge(temp, left_on='ticker', right_on='ticker')
itog = itog.drop(['mean_value'], axis = 1)

In [ ]:
itog.volume = itog.volume/itog.mean_volume
itog.drop(['mean_volume'], axis = 1)
itog

            date ticker   open  ...    volume               company   mean_volume
0       20090821      A  25.60  ...  0.989125  Agilent Technologies  35140.146939
1       20090824      A  25.64  ...  0.633094  Agilent Technologies  35140.146939
2       20090825      A  25.50  ...  0.879080  Agilent Technologies  35140.146939
3       20090826      A  25.32  ...  0.948602  Agilent Technologies  35140.146939
4       20090827      A  25.50  ...  1.997032  Agilent Technologies  35140.146939
...          ...    ...    ...  ...       ...                   ...           ...
122569  20100813    ZMH  51.72  ...  0.722313                   NaN  20158.840816
122570  20100816    ZMH  51.13  ...  0.669136                   NaN  20158.840816
122571  20100817    ZMH  51.14  ...  1.016824                   NaN  20158.840816
122572  20100819    ZMH  51.63  ...  0.905756                   NaN  20158.840816
122573  20100820    ZMH  50.03  ...  0.882590                   NaN  20158.840816

[122574 rows x 9 columns]